/*============================================================================
* ファイル名 : XxcsoSalesNotificationConstants
* 概要説明   : 商談決定情報通知固定値クラス
* バージョン : 1.0
*============================================================================
* 修正履歴
* 日付       Ver. 担当者       修正内容
* ---------- ---- ------------ ----------------------------------------------
* 2009-01-08 1.0  SCS小川浩    新規作成
*============================================================================
*/
package itoen.oracle.apps.xxcso.xxcso007002j.util;

/*******************************************************************************
 * アドオン：商談決定情報通知の固定値クラスです。
 * @author  SCS小川浩
 * @version 1.0
 *******************************************************************************
 */
public class XxcsoSalesNotificationConstants 
{
  /*****************************************************************************
   * 実行モード
   *****************************************************************************
   */
  public static final String MODE_REQUEST = "REQUEST";
  public static final String MODE_RESULT  = "RESULT";
  public static final String MODE_NOTIFY  = "NOTIFY";

  /*****************************************************************************
   * 商品区分
   *****************************************************************************
   */
  public static final String SALES_CLASS_CAMP = "3";
  public static final String SALES_CLASS_CUT  = "5";
}