/*************************************************************************
 * Copyright(c)SCSK Corporation, 2015. All rights reserved.
 *
 * DATABASE LINK Name : T4_HON
 * Description        : T4→本番環境のデータベースリンクを削除する
 * Version            : 1.0
 * 
 * Change Record
 * ------------- ----- ------------ -------------------------------------
 *  Date          Ver.  Editor       Description
 * ------------- ----- ------------ -------------------------------------
 *  2022/11/01    1.0   H.Iitsuka    新規作成
 ************************************************************************/
DROP DATABASE LINK t4_hon;
