/*============================================================================
* ファイル名 : XxcsoQuoteSearchConstants
* 概要説明   : 見積検索固定値クラス
* バージョン : 1.0
*============================================================================
* 修正履歴
* 日付       Ver. 担当者       修正内容
* ---------- ---- ------------ ----------------------------------------------
* 2008-12-22 1.0  SCS張吉    新規作成
*============================================================================
*/
package itoen.oracle.apps.xxcso.xxcso017006j.util;

/*******************************************************************************
 * アドオン：見積検索の固定値クラスです。
 * @author  SCS張吉
 * @version 1.0
 *******************************************************************************
 */
public class XxcsoQuoteSearchConstants 
{
 /*****************************************************************************
  * 見積種別
  *****************************************************************************
  */
  public static final String QUOTE_TYPE_1 = "1"; // 販売先用見積
  public static final String QUOTE_TYPE_2 = "2"; // 帳合問屋先用見積
  
 /*****************************************************************************
  * 見積検索用トークン値
  *****************************************************************************
  */
  public static final String
    TOKEN_VALUE_QUOTE_TYPE                = "見積種別";
  public static final String
    TOKEN_VALUE_QUOTE_NUMBER              = "見積番号";
  public static final String
    TOKEN_VALUE_QUOTE_REVISION_NUMBER     = "版";

 /*****************************************************************************
  * 実行区分
  *****************************************************************************
  */
  public static final String EXECUTE_MODE_UPDATE = "UPDATE";    
}