/*============================================================================
* ファイル名 : XxcsoQuoteSearchConstants
* 概要説明   : 見積検索固定値クラス
* バージョン : 1.1
*============================================================================
* 修正履歴
* 日付       Ver. 担当者       修正内容
* ---------- ---- ------------ ----------------------------------------------
* 2008-12-22 1.0  SCS張吉      新規作成
* 2012-09-10 1.1  SCSK穆宏旭  【E_本稼動_09945】見積書の照会方法の変更対応
*============================================================================
*/
package itoen.oracle.apps.xxcso.xxcso017006j.util;

/*******************************************************************************
 * アドオン：見積検索の固定値クラスです。
 * @author  SCS張吉
 * @version 1.0
 *******************************************************************************
 */
public class XxcsoQuoteSearchConstants 
{
 /*****************************************************************************
  * 見積種別
  *****************************************************************************
  */
  public static final String QUOTE_TYPE_1 = "1"; // 販売先用見積
  public static final String QUOTE_TYPE_2 = "2"; // 帳合問屋先用見積
  
 /*****************************************************************************
  * 見積検索用トークン値
  *****************************************************************************
  */
  public static final String
    TOKEN_VALUE_QUOTE_TYPE                = "見積種別";
  public static final String
    TOKEN_VALUE_QUOTE_NUMBER              = "見積番号";
  public static final String
    TOKEN_VALUE_QUOTE_REVISION_NUMBER     = "版";

 /*****************************************************************************
  * 実行区分
  *****************************************************************************
  */
  public static final String EXECUTE_MODE_UPDATE = "UPDATE";    
  // 2012-09-10 Ver1.1 [E_本稼動_09945] Add Start
  public static final String EXECUTE_MODE_READ_ONLY = "READ_ONLY";
  // 2012-09-10 Ver1.1 [E_本稼動_09945] Add End

  // 2012-09-10 Ver1.1 [E_本稼動_09945] Add Start
  /*****************************************************************************
   * プロファイルオプション値
   *****************************************************************************
   */
  public static final String XXCSO1_QUOTE_STANDARD = "XXCSO1_QUOTE_STANDARD";
  public static final String XXCSO1_QUOTE_STANDARD_VALUE_3 = "3";
  // 2012-09-10 Ver1.1 [E_本稼動_09945] Add End
}