/*============================================================================
* ファイル名 : XxwshPageLayoutPVOImpl
* 概要説明   : ページレイアウトリージョンビューオブジェクト
* バージョン : 1.0
*============================================================================
* 修正履歴
* 日付       Ver. 担当者       修正内容
* ---------- ---- ------------ ----------------------------------------------
* 2008-04-17 1.0  北寒寺正夫     新規作成
*============================================================================
*/
package itoen.oracle.apps.xxwsh.xxwsh920002j.server;
import oracle.apps.fnd.framework.server.OAViewObjectImpl;
/***************************************************************************
 * ページレイアウトリージョンビューオブジェクトクラスです。
 * @author  ORACLE 北寒寺 正夫
 * @version 1.0
 ***************************************************************************
 */
public class XxwshPageLayoutPVOImpl extends OAViewObjectImpl 
{
  /**
   * 
   * This is the default constructor (do not remove)
   */
  public XxwshPageLayoutPVOImpl()
  {
  }
}