/*============================================================================
* ファイル名 : XxcsoDeptMonthlyPlansConstants
* 概要説明   : 売上計画の選択画面共通固定値クラス
* バージョン : 1.0
*============================================================================
* 修正履歴
* 日付       Ver. 担当者       修正内容
* ---------- ---- ------------ ----------------------------------------------
* 2009-01-27 1.0  SCS及川領  新規作成
*============================================================================
*/
package itoen.oracle.apps.xxcso.xxcso019003j.util;
/*******************************************************************************
 * アドオン：売上計画の選択画面の共通固定値クラス
 * @author  SCS及川領
 * @version 1.0
 *******************************************************************************
 */
public class XxcsoDeptMonthlyPlansConstants 
{
  /*****************************************************************************
   * リターンパラメータ
   *****************************************************************************
   */
  public static final String RETURN_PARAM_URL    = "URL";
  public static final String RETURN_PARAM_MSG    = "MESSAGE";

  /*****************************************************************************
   * タイトル名
   *****************************************************************************
   */
  public static final String TITLE_THIS_MONTH    = "当月";
  public static final String TITLE_NEXT_MONTH    = "適用月";

  /*****************************************************************************
   * 売上計画開示区分のデフォルト値
   *****************************************************************************
   */
  public static final String DEF_SALES_PLAN_REL_DIV    = "1";

  /*****************************************************************************
   * 売上計画用トークン値
   *****************************************************************************
   */
  public static final String TOKEN_VALUE_SALES_PLANS     = "売上計画";
  public static final String TOKEN_VALUE_MONTH           = "当月・過去月";

}