REM +=========================================================================+
REM                                                                            
REM   [概要]                                                                   
REM          AR補助元帳残高で発生するORA-01555エラーへの対応として、           
REM          初期化パラメータ undo_retention の値を 21600 に設定するSQL        
REM          →IaaSリフト(2022/07)以降、『AR補助元帳残高』の最長実行時間(3:30) 
REM            から、1.5倍のバッファを持たせたきりのよい6時間(21600秒)を設定   
REM          ※E_本稼動_19004                                                  
REM                                                                            
REM                                                                            
REM   [作成/更新履歴]                                                          
REM        作成者  ：   SCSK 飯塚           2023/01/10 1.0.0                   
REM        更新履歴：   SCSK 飯塚           2023/01/10 1.0.0                   
REM                       初版/E_本稼動_19004                                  
REM                                                                            
REM                                                                            
REM +=========================================================================+

alter system set undo_retention = 21600 scope=memory sid='*';