/*************************************************************************
 * 
 * VIEW Name       : UNLOCK_SCHEMA_STATS
 * Description     : スキーマロック解除
 * Version         : 1.0
 * 
 * Change Record
 * ------------- ----- ------------ -------------------------------------
 *  Date          Ver.  Editor       Description
 * ------------- ----- ------------ -------------------------------------
 *  2011/02/03    1.0  T.Yoshimoto    初回作成
 ************************************************************************/
exec dbms_stats.unlock_schema_stats('schema_owner'); 
