"""
--------------------------------------------------------------------------------

     [概要]
        PythonでOIC接続機能で発生した際にメッセージ情報を保持する例外クラス

     [作成/更新履歴]
          作成者  ：   SCSK   吉岡           2022/07/20 Draft1A
          更新履歴：   SCSK   吉岡           2022/07/20 Draft1A  初版
                       SCSK   久保田         2023/02/22 Issue1.0 Issue化

     [パラメータ]
        なし

--------------------------------------------------------------------------------
"""

### Python共通例外クラス ###
class PyComnException(Exception):
    """
    初期処理
      [パラメータ]
        メッセージID  ：msgId      string
        置換文字リスト：repStr     list
      [戻り値]
        なし
      [例外]
        なし
    """
    def __init__(self, msgId, repStr=[]):
        ## インスタンス変数を設定
        self.msgId = msgId
        self.repStr = repStr
